<?xml version="1.0"?>
<net name="torch_jit" version="11">
	<layers>
		<layer id="1" name="input_ids" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="input_ids" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="input_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="attention_mask" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="attention_mask" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="attention_mask">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="qa_outputs.bias" type="Const" version="opset1">
			<data element_type="f32" shape="2" offset="0" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="qa_outputs.bias" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="qa_outputs.bias">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="distilbert.transformer.layer.5.ffn.lin2.bias" type="Const" version="opset1">
			<data element_type="f32" shape="768" offset="8" size="3072" />
			<rt_info>
				<attribute name="fused_names" version="0" value="distilbert.transformer.layer.5.ffn.lin2.bias" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="distilbert.transformer.layer.5.ffn.lin2.bias">
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="distilbert.transformer.layer.5.ffn.lin1.bias" type="Const" version="opset1">
			<data element_type="f32" shape="3072" offset="3080" size="12288" />
			<rt_info>
				<attribute name="fused_names" version="0" value="distilbert.transformer.layer.5.ffn.lin1.bias" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="distilbert.transformer.layer.5.ffn.lin1.bias">
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="distilbert.transformer.layer.5.attention.out_lin.bias" type="Const" version="opset1">
			<data element_type="f32" shape="768" offset="15368" size="3072" />
			<rt_info>
				<attribute name="fused_names" version="0" value="distilbert.transformer.layer.5.attention.out_lin.bias" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="distilbert.transformer.layer.5.attention.out_lin.bias">
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="/distilbert/transformer/layer.0/attention/Constant_12" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="18440" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/transformer/layer.0/attention/Constant_12" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/distilbert/transformer/layer.0/attention/Constant_12_output_0" />
			</output>
		</layer>
		<layer id="7" name="/distilbert/transformer/layer.0/attention/Equal" type="Equal" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/transformer/layer.0/attention/Equal" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="BOOL" names="/distilbert/transformer/layer.0/attention/Equal_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="distilbert.transformer.layer.4.ffn.lin2.bias" type="Const" version="opset1">
			<data element_type="f32" shape="768" offset="18448" size="3072" />
			<rt_info>
				<attribute name="fused_names" version="0" value="distilbert.transformer.layer.4.ffn.lin2.bias" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="distilbert.transformer.layer.4.ffn.lin2.bias">
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="distilbert.transformer.layer.4.ffn.lin1.bias" type="Const" version="opset1">
			<data element_type="f32" shape="3072" offset="21520" size="12288" />
			<rt_info>
				<attribute name="fused_names" version="0" value="distilbert.transformer.layer.4.ffn.lin1.bias" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="distilbert.transformer.layer.4.ffn.lin1.bias">
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="distilbert.transformer.layer.4.attention.out_lin.bias" type="Const" version="opset1">
			<data element_type="f32" shape="768" offset="33808" size="3072" />
			<rt_info>
				<attribute name="fused_names" version="0" value="distilbert.transformer.layer.4.attention.out_lin.bias" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="distilbert.transformer.layer.4.attention.out_lin.bias">
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="distilbert.transformer.layer.3.ffn.lin2.bias" type="Const" version="opset1">
			<data element_type="f32" shape="768" offset="36880" size="3072" />
			<rt_info>
				<attribute name="fused_names" version="0" value="distilbert.transformer.layer.3.ffn.lin2.bias" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="distilbert.transformer.layer.3.ffn.lin2.bias">
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="distilbert.transformer.layer.3.ffn.lin1.bias" type="Const" version="opset1">
			<data element_type="f32" shape="3072" offset="39952" size="12288" />
			<rt_info>
				<attribute name="fused_names" version="0" value="distilbert.transformer.layer.3.ffn.lin1.bias" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="distilbert.transformer.layer.3.ffn.lin1.bias">
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="distilbert.transformer.layer.3.attention.out_lin.bias" type="Const" version="opset1">
			<data element_type="f32" shape="768" offset="52240" size="3072" />
			<rt_info>
				<attribute name="fused_names" version="0" value="distilbert.transformer.layer.3.attention.out_lin.bias" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="distilbert.transformer.layer.3.attention.out_lin.bias">
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="distilbert.transformer.layer.2.ffn.lin2.bias" type="Const" version="opset1">
			<data element_type="f32" shape="768" offset="55312" size="3072" />
			<rt_info>
				<attribute name="fused_names" version="0" value="distilbert.transformer.layer.2.ffn.lin2.bias" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="distilbert.transformer.layer.2.ffn.lin2.bias">
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="distilbert.transformer.layer.2.ffn.lin1.bias" type="Const" version="opset1">
			<data element_type="f32" shape="3072" offset="58384" size="12288" />
			<rt_info>
				<attribute name="fused_names" version="0" value="distilbert.transformer.layer.2.ffn.lin1.bias" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="distilbert.transformer.layer.2.ffn.lin1.bias">
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="distilbert.transformer.layer.2.attention.out_lin.bias" type="Const" version="opset1">
			<data element_type="f32" shape="768" offset="70672" size="3072" />
			<rt_info>
				<attribute name="fused_names" version="0" value="distilbert.transformer.layer.2.attention.out_lin.bias" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="distilbert.transformer.layer.2.attention.out_lin.bias">
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="distilbert.transformer.layer.1.ffn.lin2.bias" type="Const" version="opset1">
			<data element_type="f32" shape="768" offset="73744" size="3072" />
			<rt_info>
				<attribute name="fused_names" version="0" value="distilbert.transformer.layer.1.ffn.lin2.bias" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="distilbert.transformer.layer.1.ffn.lin2.bias">
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="distilbert.transformer.layer.1.ffn.lin1.bias" type="Const" version="opset1">
			<data element_type="f32" shape="3072" offset="76816" size="12288" />
			<rt_info>
				<attribute name="fused_names" version="0" value="distilbert.transformer.layer.1.ffn.lin1.bias" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="distilbert.transformer.layer.1.ffn.lin1.bias">
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="distilbert.transformer.layer.1.attention.out_lin.bias" type="Const" version="opset1">
			<data element_type="f32" shape="768" offset="89104" size="3072" />
			<rt_info>
				<attribute name="fused_names" version="0" value="distilbert.transformer.layer.1.attention.out_lin.bias" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="distilbert.transformer.layer.1.attention.out_lin.bias">
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="distilbert.transformer.layer.0.ffn.lin2.bias" type="Const" version="opset1">
			<data element_type="f32" shape="768" offset="92176" size="3072" />
			<rt_info>
				<attribute name="fused_names" version="0" value="distilbert.transformer.layer.0.ffn.lin2.bias" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="distilbert.transformer.layer.0.ffn.lin2.bias">
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="distilbert.transformer.layer.0.ffn.lin1.bias" type="Const" version="opset1">
			<data element_type="f32" shape="3072" offset="95248" size="12288" />
			<rt_info>
				<attribute name="fused_names" version="0" value="distilbert.transformer.layer.0.ffn.lin1.bias" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="distilbert.transformer.layer.0.ffn.lin1.bias">
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="distilbert.transformer.layer.0.attention.out_lin.bias" type="Const" version="opset1">
			<data element_type="f32" shape="768" offset="107536" size="3072" />
			<rt_info>
				<attribute name="fused_names" version="0" value="distilbert.transformer.layer.0.attention.out_lin.bias" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="distilbert.transformer.layer.0.attention.out_lin.bias">
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="distilbert.embeddings.word_embeddings.weight" type="Const" version="opset1">
			<data element_type="f32" shape="28996, 768" offset="110608" size="89075712" />
			<rt_info>
				<attribute name="fused_names" version="0" value="distilbert.embeddings.word_embeddings.weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="distilbert.embeddings.word_embeddings.weight">
					<dim>28996</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_255188" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="18440" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_255188" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="25" name="/distilbert/embeddings/word_embeddings/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/embeddings/word_embeddings/Gather" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>28996</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/distilbert/embeddings/word_embeddings/Gather_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="distilbert.embeddings.position_embeddings.weight" type="Const" version="opset1">
			<data element_type="f32" shape="512, 768" offset="89186320" size="1572864" />
			<rt_info>
				<attribute name="fused_names" version="0" value="distilbert.embeddings.position_embeddings.weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="distilbert.embeddings.position_embeddings.weight">
					<dim>512</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Constant_4" type="Const" version="opset1">
			<data element_type="i64" shape="1, 512" offset="90759184" size="4096" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="onnx::Slice_110">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="/distilbert/embeddings/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="18440" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/embeddings/Constant_1" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/distilbert/embeddings/Constant_1_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="/distilbert/embeddings/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/embeddings/Shape" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/distilbert/embeddings/Shape_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="/distilbert/embeddings/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="90763280" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/embeddings/Constant" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/distilbert/embeddings/Constant_output_0" />
			</output>
		</layer>
		<layer id="31" name="Constant_255192" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="18440" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_255192" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="32" name="/distilbert/embeddings/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/embeddings/Constant, /distilbert/embeddings/Gather, Constant_255192" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/distilbert/embeddings/Gather_output_0" />
			</output>
		</layer>
		<layer id="33" name="Constant_255196" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="18440" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_255196" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="/distilbert/embeddings/Unsqueeze" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/embeddings/Unsqueeze, Constant_255196" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/distilbert/embeddings/Unsqueeze_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="/distilbert/embeddings/Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="90763280" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/embeddings/Constant_3" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/distilbert/embeddings/Constant_3_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="/distilbert/embeddings/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="90763280" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/embeddings/Constant_2" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/distilbert/embeddings/Constant_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="/distilbert/embeddings/Slice" type="Slice" version="opset8">
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/embeddings/Slice" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="I64" names="/distilbert/embeddings/Slice_output_0">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Constant_255207" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="18440" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_255207" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="39" name="/distilbert/embeddings/position_embeddings/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/embeddings/position_embeddings/Gather" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/distilbert/embeddings/position_embeddings/Gather_output_0">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="/distilbert/embeddings/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/embeddings/Add" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/distilbert/embeddings/Add_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Constant_255210" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="90763288" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_255210" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="/distilbert/embeddings/LayerNorm/ReduceMean" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/embeddings/LayerNorm/ReduceMean" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/distilbert/embeddings/LayerNorm/ReduceMean_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="/distilbert/embeddings/LayerNorm/Sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/embeddings/LayerNorm/Sub" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/distilbert/embeddings/LayerNorm/Sub_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="/distilbert/embeddings/LayerNorm/Constant" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="90763296" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/embeddings/LayerNorm/Constant" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="/distilbert/embeddings/LayerNorm/Constant_output_0" />
			</output>
		</layer>
		<layer id="45" name="/distilbert/embeddings/LayerNorm/Pow" type="Power" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/embeddings/LayerNorm/Pow" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/distilbert/embeddings/LayerNorm/Pow_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Constant_255215" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="90763288" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_255215" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="/distilbert/embeddings/LayerNorm/ReduceMean_1" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/embeddings/LayerNorm/ReduceMean_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/distilbert/embeddings/LayerNorm/ReduceMean_1_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="/distilbert/embeddings/LayerNorm/Constant_1" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="90763300" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/embeddings/LayerNorm/Constant_1" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="/distilbert/embeddings/LayerNorm/Constant_1_output_0" />
			</output>
		</layer>
		<layer id="49" name="/distilbert/embeddings/LayerNorm/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/embeddings/LayerNorm/Add" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/distilbert/embeddings/LayerNorm/Add_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="/distilbert/embeddings/LayerNorm/Sqrt" type="Sqrt" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/embeddings/LayerNorm/Sqrt" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/distilbert/embeddings/LayerNorm/Sqrt_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="/distilbert/embeddings/LayerNorm/Div" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/embeddings/LayerNorm/Div" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/distilbert/embeddings/LayerNorm/Div_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="distilbert.embeddings.LayerNorm.weight" type="Const" version="opset1">
			<data element_type="f32" shape="768" offset="90763304" size="3072" />
			<rt_info>
				<attribute name="fused_names" version="0" value="distilbert.embeddings.LayerNorm.weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="distilbert.embeddings.LayerNorm.weight">
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="/distilbert/embeddings/LayerNorm/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/embeddings/LayerNorm/Mul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/distilbert/embeddings/LayerNorm/Mul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="distilbert.embeddings.LayerNorm.bias" type="Const" version="opset1">
			<data element_type="f32" shape="768" offset="90766376" size="3072" />
			<rt_info>
				<attribute name="fused_names" version="0" value="distilbert.embeddings.LayerNorm.bias" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="distilbert.embeddings.LayerNorm.bias">
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="/distilbert/embeddings/LayerNorm/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/embeddings/LayerNorm/Add_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/distilbert/embeddings/LayerNorm/Add_1_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="/distilbert/transformer/layer.0/attention/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/transformer/layer.0/attention/Shape" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/distilbert/transformer/layer.0/attention/Shape_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="/distilbert/transformer/layer.0/attention/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="18440" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/transformer/layer.0/attention/Constant" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/distilbert/transformer/layer.0/attention/Constant_output_0" />
			</output>
		</layer>
		<layer id="58" name="Constant_255225" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="18440" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_255225" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="59" name="/distilbert/transformer/layer.0/attention/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/transformer/layer.0/attention/Constant, /distilbert/transformer/layer.0/attention/Gather, Constant_255225" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/distilbert/transformer/layer.0/attention/Gather_output_0" />
			</output>
		</layer>
		<layer id="60" name="Constant_255287" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="18440" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_255287" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="/distilbert/transformer/layer.0/attention/Unsqueeze_3" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/transformer/layer.0/attention/Unsqueeze_3, Constant_255287" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/distilbert/transformer/layer.0/attention/Unsqueeze_3_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="/distilbert/transformer/layer.0/attention/Constant_13" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="90763280" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/transformer/layer.0/attention/Constant_13" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/distilbert/transformer/layer.0/attention/Constant_13_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="/distilbert/transformer/layer.0/attention/Constant_14" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="90763280" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/transformer/layer.0/attention/Constant_14" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/distilbert/transformer/layer.0/attention/Constant_14_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="/distilbert/transformer/layer.0/attention/Shape_1" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/transformer/layer.0/attention/Shape_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/distilbert/transformer/layer.0/attention/Shape_1_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="/distilbert/transformer/layer.0/attention/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="90763280" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/transformer/layer.0/attention/Constant_1" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/distilbert/transformer/layer.0/attention/Constant_1_output_0" />
			</output>
		</layer>
		<layer id="66" name="Constant_255229" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="18440" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_255229" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="67" name="/distilbert/transformer/layer.0/attention/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/transformer/layer.0/attention/Constant_1, /distilbert/transformer/layer.0/attention/Gather_1, Constant_255229" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/distilbert/transformer/layer.0/attention/Gather_1_output_0" />
			</output>
		</layer>
		<layer id="68" name="Constant_255291" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="18440" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_255291" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="/distilbert/transformer/layer.0/attention/Unsqueeze_4" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/transformer/layer.0/attention/Unsqueeze_4, Constant_255291" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/distilbert/transformer/layer.0/attention/Unsqueeze_4_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="/distilbert/transformer/layer.0/attention/Concat_3" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/transformer/layer.0/attention/Concat_3, /distilbert/transformer/layer.0/attention/Constant_13, /distilbert/transformer/layer.0/attention/Constant_14" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/distilbert/transformer/layer.0/attention/Concat_3_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="/distilbert/transformer/layer.0/attention/Reshape_3" type="Reshape" version="opset1">
			<data special_zero="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/transformer/layer.0/attention/Reshape_3" />
			</rt_info>
			<input>
				<port id="0" precision="BOOL">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="/distilbert/transformer/layer.0/attention/Reshape_3_output_0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="distilbert.transformer.layer.0.attention.q_lin.bias" type="Const" version="opset1">
			<data element_type="f32" shape="768" offset="90769448" size="3072" />
			<rt_info>
				<attribute name="fused_names" version="0" value="distilbert.transformer.layer.0.attention.q_lin.bias" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="distilbert.transformer.layer.0.attention.q_lin.bias">
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="onnx::MatMul_738" type="Const" version="opset1">
			<data element_type="f32" shape="768, 768" offset="90772520" size="2359296" />
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::MatMul_738" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::MatMul_738">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="/distilbert/transformer/layer.0/attention/q_lin/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/transformer/layer.0/attention/q_lin/MatMul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/distilbert/transformer/layer.0/attention/q_lin/MatMul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="/distilbert/transformer/layer.0/attention/q_lin/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/transformer/layer.0/attention/q_lin/Add" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/distilbert/transformer/layer.0/attention/q_lin/Add_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Constant_255233" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="18440" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_255233" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="/distilbert/transformer/layer.0/attention/Unsqueeze" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/transformer/layer.0/attention/Unsqueeze, Constant_255233" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/distilbert/transformer/layer.0/attention/Unsqueeze_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="/distilbert/transformer/layer.0/attention/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="90763288" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/transformer/layer.0/attention/Constant_2" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/distilbert/transformer/layer.0/attention/Constant_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="/distilbert/transformer/layer.0/attention/Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="93131816" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/transformer/layer.0/attention/Constant_3" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/distilbert/transformer/layer.0/attention/Constant_3_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="/distilbert/transformer/layer.0/attention/Constant_4" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="93131824" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/transformer/layer.0/attention/Constant_4" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/distilbert/transformer/layer.0/attention/Constant_4_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="/distilbert/transformer/layer.0/attention/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/transformer/layer.0/attention/Concat, /distilbert/transformer/layer.0/attention/Constant_2, /distilbert/transformer/layer.0/attention/Constant_3, /distilbert/transformer/layer.0/attention/Constant_4" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/distilbert/transformer/layer.0/attention/Concat_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="/distilbert/transformer/layer.0/attention/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/transformer/layer.0/attention/Reshape" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/distilbert/transformer/layer.0/attention/Reshape_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Constant_255258" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="93131832" size="32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_255258" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="/distilbert/transformer/layer.0/attention/Transpose" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/transformer/layer.0/attention/Transpose" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/distilbert/transformer/layer.0/attention/Transpose_output_0">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="/distilbert/transformer/layer.0/attention/Constant_11" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="93131864" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/transformer/layer.0/attention/Constant_11" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="/distilbert/transformer/layer.0/attention/Constant_11_output_0" />
			</output>
		</layer>
		<layer id="86" name="/distilbert/transformer/layer.0/attention/Div" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/transformer/layer.0/attention/Div" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/distilbert/transformer/layer.0/attention/Div_output_0">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="distilbert.transformer.layer.0.attention.k_lin.bias" type="Const" version="opset1">
			<data element_type="f32" shape="768" offset="93131868" size="3072" />
			<rt_info>
				<attribute name="fused_names" version="0" value="distilbert.transformer.layer.0.attention.k_lin.bias" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="distilbert.transformer.layer.0.attention.k_lin.bias">
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="onnx::MatMul_748" type="Const" version="opset1">
			<data element_type="f32" shape="768, 768" offset="93134940" size="2359296" />
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::MatMul_748" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::MatMul_748">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="/distilbert/transformer/layer.0/attention/k_lin/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/transformer/layer.0/attention/k_lin/MatMul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/distilbert/transformer/layer.0/attention/k_lin/MatMul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="/distilbert/transformer/layer.0/attention/k_lin/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/transformer/layer.0/attention/k_lin/Add" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/distilbert/transformer/layer.0/attention/k_lin/Add_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Constant_255239" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="18440" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_255239" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="/distilbert/transformer/layer.0/attention/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/transformer/layer.0/attention/Unsqueeze_1, Constant_255239" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/distilbert/transformer/layer.0/attention/Unsqueeze_1_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="/distilbert/transformer/layer.0/attention/Constant_5" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="90763288" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/transformer/layer.0/attention/Constant_5" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/distilbert/transformer/layer.0/attention/Constant_5_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="/distilbert/transformer/layer.0/attention/Constant_6" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="93131816" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/transformer/layer.0/attention/Constant_6" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/distilbert/transformer/layer.0/attention/Constant_6_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="/distilbert/transformer/layer.0/attention/Constant_7" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="93131824" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/transformer/layer.0/attention/Constant_7" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/distilbert/transformer/layer.0/attention/Constant_7_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="/distilbert/transformer/layer.0/attention/Concat_1" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/transformer/layer.0/attention/Concat_1, /distilbert/transformer/layer.0/attention/Constant_5, /distilbert/transformer/layer.0/attention/Constant_6, /distilbert/transformer/layer.0/attention/Constant_7" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/distilbert/transformer/layer.0/attention/Concat_1_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="/distilbert/transformer/layer.0/attention/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/distilbert/transformer/layer.0/attention/Reshape_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/distilbert/transformer/layer.0/attention/Reshape_1_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
